In [197]:
import pandas as pd
import numpy as np

In [297]:
ratings_data = pd.read_csv('ml-1m/ratings.dat',sep='::',names=['userId','movieId','rating','timestamp'],dtype=np.float32)

/home/parijat/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [299]:
movie_data = pd.read_csv('ml-1m/movies.dat',sep='::',names=['movieId','title','genres'])

/home/parijat/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [301]:
users_data = pd.read_csv('ml-1m/users.dat',sep='::',names=['userId','gender','age','occupation','zip-code'])

/home/parijat/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [302]:
users_data.head()

   userId gender  age  occupation zip-code
0       1      F    1          10    48067
1       2      M   56          16    70072
2       3      M   25          15    55117
3       4      M   45           7    02460
4       5      M   25          20    55455

In [303]:
ratings_data.head()

   userId  movieId  rating    timestamp
0     1.0   1193.0     5.0  978300736.0
1     1.0    661.0     3.0  978302080.0
2     1.0    914.0     3.0  978301952.0
3     1.0   3408.0     4.0  978300288.0
4     1.0   2355.0     5.0  978824320.0

In [304]:
movie_data.head()

   movieId                               title                        genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy

In [305]:
print(users_data.shape,movie_data.shape,ratings_data.shape)

(6040, 5) (3883, 3) (1000209, 4)

In [306]:
movie_data['movieId'].nunique()

3883

In [307]:
users_data['gender'] = users_data['gender'].apply(lambda x: 1 if x=='M' else 0)

In [308]:
movie_data['year'] = movie_data['title'].apply(lambda x:x.split(' ')[-1])

In [309]:
movie_data['year'] = movie_data['year'].apply(lambda x:np.int(x[-5:-1]))
#movie_data['dem'] = movie_data['year'].apply(lambda x:True if len(x)>4 else False)

In [310]:
movie_data['genres'] = movie_data['genres'].apply(lambda x: x.split('|'))

In [311]:
movie_data.head()

,movieId,title,genres,year
0,1,Toy Story (1995),"[Animation, Children's, Comedy]",1995
1,2,Jumanji (1995),"[Adventure, Children's, Fantasy]",1995
2,3,Grumpier Old Men (1995),"[Comedy, Romance]",1995
3,4,Waiting to Exhale (1995),"[Comedy, Drama]",1995
4,5,Father of the Bride Part II (1995),[Comedy],1995

In [312]:
ratings_data['month']=ratings_data['timestamp'].apply(lambda x:pd.Timestamp(x).month)

In [313]:
ratings_data['month'].value_counts()

1    1000209
Name: month, dtype: int64

In [314]:
ratings_data['second']=ratings_data['timestamp'].apply(lambda x:pd.Timestamp(x).second)

In [315]:
ratings_data['second'].value_counts()

0    962251
1     37958
Name: second, dtype: int64

In [316]:
all_genres = {}
for i,row in movie_data.iterrows():
    
    for genre in row['genres']:
        if genre not in all_genres:
            all_genres[genre] = 1
            
movie_data = pd.concat([movie_data,pd.DataFrame(data=np.zeros((movie_data.shape[0],len(all_genres.keys()))),columns=all_genres.keys())],axis=1)

In [317]:
movie_data.shape

(3883, 22)

In [318]:
for i,row in movie_data.iterrows():
    for genre in row['genres']:
        movie_data.loc[i,genre]=1.0

In [319]:
movie_data.head()

,movieId,title,genres,year,Animation,Children's,Comedy,Adventure,Fantasy,Romance,...,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1,Toy Story (1995),"[Animation, Children's, Comedy]",1995,1.0,1.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),"[Adventure, Children's, Fantasy]",1995,0.0,1.0,0.0,1.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),"[Comedy, Romance]",1995,0.0,0.0,1.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),"[Comedy, Drama]",1995,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),[Comedy],1995,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [320]:
movie_data['name'] = movie_data['title'].apply(lambda x:x[:-6])

In [321]:
movie_data['movieId'].min()

1

In [322]:
movie_data = movie_data.drop(labels=['title','genres'],axis=1)

In [323]:

movie_data.head()

,movieId,year,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,...,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western,name
0,1,1995,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,Toy Story
1,2,1995,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,Jumanji
2,3,1995,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,Grumpier Old Men
3,4,1995,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,Waiting to Exhale
4,5,1995,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,Father of the Bride Part II

In [370]:
ratings = ratings_data.merge(movie_data,on='movieId')

In [371]:
ratings.head()

,userId,movieId,rating,timestamp,month,second,year,Animation,Children's,Comedy,...,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western,name
0,1.0,1193.0,5.0,978300736.0,1,0,1975,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,One Flew Over the Cuckoo's Nest
1,2.0,1193.0,5.0,978298432.0,1,0,1975,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,One Flew Over the Cuckoo's Nest
2,12.0,1193.0,4.0,978220160.0,1,0,1975,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,One Flew Over the Cuckoo's Nest
3,15.0,1193.0,4.0,978199296.0,1,0,1975,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,One Flew Over the Cuckoo's Nest
4,17.0,1193.0,5.0,978158464.0,1,0,1975,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,One Flew Over the Cuckoo's Nest

In [372]:
ratings.shape

(1000209, 26)

In [373]:
ratings_data['userId'].unique(), movie_data['movieId'].unique()

(array([1.000e+00, 2.000e+00, 3.000e+00, ..., 6.038e+03, 6.039e+03,
        6.040e+03]), array([   1,    2,    3, ..., 3950, 3951, 3952]))

In [374]:
ratings = ratings[['userId','movieId']].astype(np.int32)
ratings.head()

   userId  movieId
0       1     1193
1       2     1193
2      12     1193
3      15     1193
4      17     1193

In [375]:
#ratings = ratings.set_index('userId')

In [376]:
ratings.head()
ratings.shape[0]

1000209

In [377]:
ratings.T

,0,1,2,3,4,5,6,7,8,9,...,1000199,1000200,1000201,1000202,1000203,1000204,1000205,1000206,1000207,1000208
userId,1,2,12,15,17,18,19,24,28,33,...,5334,5420,5433,5494,5556,5949,5675,5780,5851,5938
movieId,1193,1193,1193,1193,1193,1193,1193,1193,1193,1193,...,3382,1843,286,3530,2198,2198,2703,2845,3607,2909

In [378]:
#df = pd.DataFrame(data=np.zeros((ratings.shape[0],movie_data['movieId'].max())),dtype=np.float16)

In [379]:
movie_data['movieId'].max(),ratings.shape[0]

(3952, 1000209)

In [380]:
number_of_cols = movie_data['movieId'].max()

number_of_rows = users_data['userId'].max()

df = pd.DataFrame(data=np.zeros((number_of_rows,number_of_cols)),columns=range(1,number_of_cols+1),dtype=np.int16,index=pd.RangeIndex(start=1,stop=number_of_rows+1))

In [393]:
df.index.max()

6040

In [394]:
from tqdm import tqdm
for i,row in tqdm(ratings.iterrows()):
    user = np.int(row['userId'])
    movie = np.int(row['movieId'])
    print(user,movie)
    df.iloc[user,movie] = 1

In [342]:
df.head()

,1,2,3,4,5,6,7,8,9,10,...,3943,3944,3945,3946,3947,3948,3949,3950,3951,3952
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [367]:
ratings = ratings.groupby(by=['userId'])['movieId'].apply(list)

In [368]:
ratings.head()

userId
1    [1193, 661, 914, 3408, 2355, 1197, 1287, 2804,...
2    [1193, 3105, 2321, 1962, 1207, 2028, 1246, 135...
3    [2355, 1197, 1270, 1961, 260, 3114, 648, 1210,...
4    [1097, 2692, 260, 2028, 3468, 1210, 480, 1196,...
5    [3408, 2355, 919, 3105, 1721, 2762, 150, 2692,...
Name: movieId, dtype: object